In [9]:
from sqlalchemy import create_engine
import pandas as pd
from config import password

In [10]:
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/Employee_Research')
con = engine.connect()

In [11]:
salarydf = pd.read_sql('select * from salaries', con)
salarydf

Empty DataFrame
Columns: [emp_no, salary]
Index: []

In [5]:
titledf = pd.read_sql('select * from titles', con)
titledf

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [8]:
combined_df = salarydf.append(titledf)
combined_df

     emp_no   salary title_id               title
0   10001.0  60117.0      NaN                 NaN
1   10002.0  65828.0      NaN                 NaN
2   10003.0  40006.0      NaN                 NaN
3   10004.0  40054.0      NaN                 NaN
4   10005.0  78228.0      NaN                 NaN
..      ...      ...      ...                 ...
2       NaN      NaN    e0001  Assistant Engineer
3       NaN      NaN    e0002            Engineer
4       NaN      NaN    e0003     Senior Engineer
5       NaN      NaN    e0004    Technique Leader
6       NaN      NaN    m0001             Manager

[300031 rows x 4 columns]

In [ ]:
average_salary = salary.mean()